# Importing Libraries and Data

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Import Data
path = r'C:\Users\samir\OneDrive\Documents\10-2022 Instacart Basket Analysis'
cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# Task Questions

## Q4. Wrangle the data so that it follows consistent logic

In [3]:
# performing functions to get a better idea of what information the dataframe contains and what it looks like
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
cust.shape

(206209, 10)

In [6]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# Renaming columns for uniformity
cust.rename(columns = {'First Name': 'first_name'}, inplace=True)

In [9]:
cust.rename(columns = {'Surnam': 'last_name'}, inplace=True)

In [10]:
cust.rename(columns = {'Gender': 'gender'}, inplace=True)

In [11]:
cust.rename(columns = {'STATE': 'state'}, inplace=True)

In [12]:
cust.rename(columns = {'Age': 'age'}, inplace=True)

In [13]:
cust.rename(columns = {'n_dependants': 'no_of_dependents'}, inplace = True)

In [14]:
cust.rename(columns = {'fam_status': 'marital_status'}, inplace=True)

In [15]:
cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Q5. Complete the fundamental data quality and consistency checks

In [16]:
# finding duplicates
cust_dups = cust[cust.duplicated()]

In [17]:
cust_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, no_of_dependents, marital_status, income]
Index: []

#### No duplicates found

In [18]:
# checking for mixed type data
for col in cust.columns.tolist():
  weird = (cust[[col]].applymap(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

first_name

#### the first name column has mixed type data

In [19]:
# check column data types
cust.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependents     int64
marital_status      object
income               int64
dtype: object

In [20]:
# change first_name data type from object to string
cust['first_name'] = cust['first_name'].astype('str')

In [21]:
# double check that there are no more mixed type data
for col in cust.columns.tolist():
  weird = (cust[[col]].applymap(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

In [22]:
# finding missing values
cust.isnull().sum()

user_id             0
first_name          0
last_name           0
gender              0
state               0
age                 0
date_joined         0
no_of_dependents    0
marital_status      0
income              0
dtype: int64

#### Originally there were 11,259 missing (NaN) values in the first_name column. This issue was resolved due to changing the column data type to string. I have concluded that I will leave the missing first names as is rather than removing or replacing them.

## Q6. Combine your customer data with the rest of your prepared Instacart data

In [27]:
# Import prepared data
ords_prods_merged = pd.read_pickle(os.path.join(path,'02 Data', 'Prepared Data', 'orders_products_merged_final.pkl'))

In [28]:
# Confirm dataframes have similar data types
cust.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependents     int64
marital_status      object
income               int64
dtype: object

In [29]:
ords_prods_merged.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_price              float64
spending_flag               object
median_order_frequency     float64
order_frequency_flag        object
dtype: object

#### The data types match, and they both share the user_id column

In [30]:
# Checking the shape
cust.shape

(206209, 10)

In [31]:
ords_prods_merged.shape

(32404859, 24)

In [32]:
# Merging the dataframes
ords_prods_cust_merged = ords_prods_merged.merge(cust, on = 'user_id')

In [33]:
# Checking the new dataframe
ords_prods_cust_merged.shape

(32404859, 33)

In [34]:
ords_prods_cust_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,order_frequency_flag,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [37]:
# exporting data
ords_prods_cust_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_cust_merged.pkl'))